Tekla Open API Reference for Tekla Structures 2025
AnalysisCompositeBeam.SlabMaterial Property
 The slab material of the analysis composite beam.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string SlabMaterial { get; set; }
Public Property SlabMaterial As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnalysisCompositeBeam Class
Tekla.Structures.Analysis Namespace